; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 box ball - object_
 )
 (:constants
   blue_box_1 blue_box_2 grey_box_1 - box
   room_3 - room
   empty - empty_0
   yellow_door_2 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (when (or (objectinroom blue_box_2 room_3) (= ?obj grey_box_1)) (hold_0)) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (when (objectinroom blue_box_2 room_3) (hold_0)) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (when (objectinroom blue_box_2 room_3) (hold_0)) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (objectinroom blue_box_2 room_3) (hold_0)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (and (objectinroom blue_box_2 room_3) (not (and (= ?obj blue_box_2) (= ?room room_3)))) (and (at_ grey_box_1) (not (= ?obj grey_box_1)))) (hold_0)) (when (and (or (= ?obj blue_box_1) (carrying blue_box_1)) (not (locked yellow_door_2))) (hold_1)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (and (= ?obj blue_box_2) (= ?room room_3)) (objectinroom blue_box_2 room_3) (= ?obj grey_box_1) (at_ grey_box_1)) (hold_0)) (when (and (carrying blue_box_1) (not (= ?obj blue_box_1)) (not (locked yellow_door_2))) (hold_1)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (and (carrying blue_box_1) (not (or (and (not (locked ?door)) (= ?door yellow_door_2)) (and (locked yellow_door_2) (not (and (locked ?door) (= ?door yellow_door_2))))))) (hold_1)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_1 room_2 room_4 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   yellow_door_1 red_door_1 green_door_1 - door
   blue_box_3 purple_box_1 - box
   green_ball_1 yellow_ball_1 blue_ball_1 - ball
 )
 (:init (agentinroom room_1) (objectinroom blue_box_1 room_1) (objectinroom blue_box_2 room_1) (objectinroom purple_box_1 room_2) (objectinroom green_ball_1 room_2) (objectinroom yellow_ball_1 room_3) (objectinroom blue_box_3 room_3) (objectinroom blue_ball_1 room_4) (objectinroom grey_box_1 room_4) (objectcolor blue_box_1 bluetype) (objectcolor blue_box_2 bluetype) (objectcolor purple_box_1 purpletype) (objectcolor green_ball_1 greentype) (objectcolor yellow_ball_1 yellowtype) (objectcolor blue_box_3 bluetype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_box_1 greytype) (objectcolor yellow_door_1 yellowtype) (objectcolor yellow_door_2 yellowtype) (objectcolor red_door_1 redtype) (objectcolor green_door_1 greentype) (emptyhands) (locked yellow_door_1) (locked yellow_door_2) (locked red_door_1) (locked green_door_1) (adjacentrooms room_2 room_1 yellow_door_1) (adjacentrooms room_1 room_2 yellow_door_1) (adjacentrooms room_3 room_1 yellow_door_2) (adjacentrooms room_1 room_3 yellow_door_2) (adjacentrooms room_4 room_2 red_door_1) (adjacentrooms room_2 room_4 red_door_1) (adjacentrooms room_4 room_3 green_door_1) (adjacentrooms room_3 room_4 green_door_1) (visited room_1) (= (total-cost) 0))
 (:goal (and (exists (?v - box)
 (and (objectcolor ?v bluetype) (at_ ?v))) (hold_0) (hold_1)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor yellow_door_2 room_1 room_3)
   added: (at_ yellow_door_2)
   goals met: 0 of 3
2. (toggle yellow_door_2)
   deleted: (locked yellow_door_2)
   goals met: 0 of 3
3. (gotoobject blue_box_1 room_1)
   deleted: (at_ yellow_door_2)
   added: (at_ blue_box_1)
   goals met: 1 of 3
4. (pick blue_box_1 room_1)
   deleted: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_1)
   added: (carrying blue_box_1) (hold_1)
   goals met: 1 of 3
5. (gotoroom room_1 room_3 yellow_door_2)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3) (visited room_3)
   goals met: 1 of 3
6. (gotodoor green_door_1 room_3 room_4)
   added: (at_ green_door_1)
   goals met: 1 of 3
7. (toggle green_door_1)
   deleted: (locked green_door_1)
   goals met: 1 of 3
8. (gotoroom room_3 room_4 green_door_1)
   deleted: (agentinroom room_3) (at_ green_door_1)
   added: (agentinroom room_4) (visited room_4)
   goals met: 1 of 3
9. (gotoobject grey_box_1 room_4)
   added: (at_ grey_box_1) (hold_0)
   goals met: 2 of 3
10. (gotoempty)
   deleted: (at_ grey_box_1)
   added: (at_ empty)
   goals met: 2 of 3
11. (drop blue_box_1 room_4)
   deleted: (carrying blue_box_1) (at_ empty)
   added: (at_ blue_box_1) (emptyhands) (objectinroom blue_box_1 room_4)
   goals met: 3 of 3
